<?php
require_once 'Hospital.php';

class HospitalRepository
{
    /**
     * بازگرداندن آرایه‌ای از اشیاء Hospital به صورت انجمنی (نام بیمارستان => شیء)
     */
    public static function getHospitals()
    {
        return [
            "بیمارستان خانواده تهران" => new Hospital("H001", "بیمارستان خانواده تهران", "A"),
            "بیمارستان هاجر تهران" => new Hospital("H002", "بیمارستان هاجر تهران", "A"),
            "بیمارستان 505 تهران" => new Hospital("H003", "بیمارستان 505 تهران", "A"),
            "بیمارستان 502 تهران" => new Hospital("H004", "بیمارستان 502 تهران", "A"),
            //"بیمارستان 600 تهران"             => new Hospital("H005", "بیمارستان 600 تهران", "A"),
            "بیمارستان تبریز" => new Hospital("H006", "بیمارستان تبریز", "A"),
            //"بیمارستان کرمانشاه"              => new Hospital("H007", "بیمارستان کرمانشاه", "A"),
            "بیمارستان اصفهان" => new Hospital("H008", "بیمارستان اصفهان", "B"),
            "بیمارستان اهواز" => new Hospital("H009", "بیمارستان اهواز", "A"),
            "بیمارستان شیراز" => new Hospital("H010", "بیمارستان شیراز", "B"),
            "بیمارستان مشهد" => new Hospital("H011", "بیمارستان مشهد", "A"),
            //"بیمارستان ارومیه"                => new Hospital("H012", "بیمارستان ارومیه", "C"),
            "بیمارستان سنندج" => new Hospital("H013", "بیمارستان سنندج", "C"),
            //"بیمارستان همدان"                 => new Hospital("H014", "بیمارستان همدان", "B"),
            "بیمارستان زنجان" => new Hospital("H015", "بیمارستان زنجان", "C"),
            "بیمارستان کرمان" => new Hospital("H017", "بیمارستان کرمان", "B"),
            "بیمارستان بیریجند" => new Hospital("H018", "بیمارستان بیریجند", "C"),
            "بیمارستان گرگان" => new Hospital("H019", "بیمارستان گرگان", "B"),
            "بیمارستان خرم آباد" => new Hospital("H020", "بیمارستان خرم آباد", "C"),
            "بیمارستان زاهدان" => new Hospital("H021", "بیمارستان زاهدان", "B"),
            //"بیمارستان مراغه"                 => new Hospital("H022", "بیمارستان مراغه", "D"),
            "بیمارستان تربت حیدریه" => new Hospital("H023", "بیمارستان تربت حیدریه", "C"),
            //"بیمارستان قوچان"                 => new Hospital("H024", "بیمارستان قوچان", "D"),
            "بیمارستان تربت جام" => new Hospital("H025", "بیمارستان تربت جام", "C"),
            "بیمارستان دزفول" => new Hospital("H027", "بیمارستان دزفول", "D"),
            "درمانگاه فلاحی تهران" => new Hospital("H028", "درمانگاه فلاحی تهران", "D"),
            //"درمانگاه شفا تهران"              => new Hospital("H029", "درمانگاه شفا تهران", "D"),
            "مرکز پایش سلامت تهران" => new Hospital("H030", "مرکز پایش سلامت تهران", "D"),
            //"داروخانه 29 فروردین تهران"       => new Hospital("H031", "داروخانه 29 فروردین تهران", "E"),
        ];

    }
}
